7767517
267 301
Input            input                    0 1 input
Split            splitncnn_input0         1 4 input input_splitncnn_0 input_splitncnn_1 input_splitncnn_2 input_splitncnn_3
Convolution      Conv_0                   1 1 input_splitncnn_3 1012 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=864
Clip             Clip_3                   1 1 1012 444 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_4                   1 1 444 1015 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=288 7=32
Clip             Clip_7                   1 1 1015 449 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_8                   1 1 449 1018 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Split            splitncnn_0              1 2 1018 1018_splitncnn_0 1018_splitncnn_1
Convolution      Conv_9                   1 1 1018_splitncnn_1 1021 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1536
Clip             Clip_12                  1 1 1021 456 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_13                  1 1 456 1024 0=96 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=864 7=96
Clip             Clip_16                  1 1 1024 461 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_17                  1 1 461 1027 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
Split            splitncnn_1              1 2 1027 1027_splitncnn_0 1027_splitncnn_1
Convolution      Conv_18                  1 1 1027_splitncnn_1 1030 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3456
Clip             Clip_21                  1 1 1030 468 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_22                  1 1 468 1033 0=144 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1296 7=144
Clip             Clip_25                  1 1 1033 473 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_26                  1 1 473 1036 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3456
BinaryOp         Add_27                   2 1 1027_splitncnn_0 1036 476 0=0
Split            splitncnn_2              1 2 476 476_splitncnn_0 476_splitncnn_1
Convolution      Conv_28                  1 1 476_splitncnn_1 1039 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3456
Clip             Clip_31                  1 1 1039 481 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_32                  1 1 481 1042 0=144 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=1296 7=144
Clip             Clip_35                  1 1 1042 486 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_36                  1 1 486 1045 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4608
Split            splitncnn_3              1 2 1045 1045_splitncnn_0 1045_splitncnn_1
Convolution      Conv_37                  1 1 1045_splitncnn_1 1048 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
Clip             Clip_40                  1 1 1048 493 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_41                  1 1 493 1051 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1728 7=192
Clip             Clip_44                  1 1 1051 498 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_45                  1 1 498 1054 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
BinaryOp         Add_46                   2 1 1045_splitncnn_0 1054 501 0=0
Split            splitncnn_4              1 2 501 501_splitncnn_0 501_splitncnn_1
Convolution      Conv_47                  1 1 501_splitncnn_1 1057 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
Clip             Clip_50                  1 1 1057 506 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_51                  1 1 506 1060 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1728 7=192
Clip             Clip_54                  1 1 1060 511 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_55                  1 1 511 1063 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
BinaryOp         Add_56                   2 1 501_splitncnn_0 1063 514 0=0
Convolution      Conv_57                  1 1 514 1066 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
Clip             Clip_60                  1 1 1066 519 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_61                  1 1 519 1069 0=192 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=1728 7=192
Clip             Clip_64                  1 1 1069 524 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_65                  1 1 524 1072 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=12288
Split            splitncnn_5              1 2 1072 1072_splitncnn_0 1072_splitncnn_1
Convolution      Conv_66                  1 1 1072_splitncnn_1 1075 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
Clip             Clip_69                  1 1 1075 531 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_70                  1 1 531 1078 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=3456 7=384
Clip             Clip_73                  1 1 1078 536 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_74                  1 1 536 1081 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
BinaryOp         Add_75                   2 1 1072_splitncnn_0 1081 539 0=0
Split            splitncnn_6              1 2 539 539_splitncnn_0 539_splitncnn_1
Convolution      Conv_76                  1 1 539_splitncnn_1 1084 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
Clip             Clip_79                  1 1 1084 544 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_80                  1 1 544 1087 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=3456 7=384
Clip             Clip_83                  1 1 1087 549 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_84                  1 1 549 1090 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
BinaryOp         Add_85                   2 1 539_splitncnn_0 1090 552 0=0
Split            splitncnn_7              1 2 552 552_splitncnn_0 552_splitncnn_1
Convolution      Conv_86                  1 1 552_splitncnn_1 1093 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
Clip             Clip_89                  1 1 1093 557 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_90                  1 1 557 1096 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=3456 7=384
Clip             Clip_93                  1 1 1096 562 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_94                  1 1 562 1099 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
BinaryOp         Add_95                   2 1 552_splitncnn_0 1099 565 0=0
Convolution      Conv_96                  1 1 565 1102 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
Clip             Clip_99                  1 1 1102 570 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_100                 1 1 570 1105 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=3456 7=384
Clip             Clip_103                 1 1 1105 575 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_104                 1 1 575 1108 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=36864
Split            splitncnn_8              1 2 1108 1108_splitncnn_0 1108_splitncnn_1
Convolution      Conv_105                 1 1 1108_splitncnn_1 1111 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
Clip             Clip_108                 1 1 1111 582 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_109                 1 1 582 1114 0=576 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=5184 7=576
Clip             Clip_112                 1 1 1114 587 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_113                 1 1 587 1117 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
BinaryOp         Add_114                  2 1 1108_splitncnn_0 1117 590 0=0
Split            splitncnn_9              1 2 590 590_splitncnn_0 590_splitncnn_1
Convolution      Conv_115                 1 1 590_splitncnn_1 1120 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
Clip             Clip_118                 1 1 1120 595 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_119                 1 1 595 1123 0=576 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=5184 7=576
Clip             Clip_122                 1 1 1123 600 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_123                 1 1 600 1126 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
BinaryOp         Add_124                  2 1 590_splitncnn_0 1126 603 0=0
Convolution      Conv_125                 1 1 603 1129 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
Clip             Clip_128                 1 1 1129 608 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_129                 1 1 608 1132 0=576 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=5184 7=576
Clip             Clip_132                 1 1 1132 613 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_133                 1 1 613 1135 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=92160
Split            splitncnn_10             1 2 1135 1135_splitncnn_0 1135_splitncnn_1
Convolution      Conv_134                 1 1 1135_splitncnn_1 1138 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
Clip             Clip_137                 1 1 1138 620 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_138                 1 1 620 1141 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=8640 7=960
Clip             Clip_141                 1 1 1141 625 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_142                 1 1 625 1144 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
BinaryOp         Add_143                  2 1 1135_splitncnn_0 1144 628 0=0
Split            splitncnn_11             1 2 628 628_splitncnn_0 628_splitncnn_1
Convolution      Conv_144                 1 1 628_splitncnn_1 1147 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
Clip             Clip_147                 1 1 1147 633 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_148                 1 1 633 1150 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=8640 7=960
Clip             Clip_151                 1 1 1150 638 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_152                 1 1 638 1153 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
BinaryOp         Add_153                  2 1 628_splitncnn_0 1153 641 0=0
Convolution      Conv_154                 1 1 641 1156 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
Clip             Clip_157                 1 1 1156 646 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_158                 1 1 646 1159 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=8640 7=960
Clip             Clip_161                 1 1 1159 651 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_162                 1 1 651 1162 0=320 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=307200
Convolution      Conv_163                 1 1 1162 1165 0=1280 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=409600
Clip             Clip_166                 1 1 1165 658 0=0.000000e+00 1=6.000000e+00
Split            splitncnn_12             1 2 658 658_splitncnn_0 658_splitncnn_1
Pooling          GlobalAveragePool_173    1 1 658_splitncnn_1 665 0=1 4=1
Reshape          Reshape_177              1 1 665 669 0=1280
InnerProduct     MatMul_178               1 1 669 671 0=320 1=0 2=409600
ReLU             Relu_179                 1 1 671 672
InnerProduct     MatMul_180               1 1 672 674 0=1280 1=0 2=409600
Sigmoid          Sigmoid_181              1 1 674 675
Reshape          Reshape_185              1 1 675 683 0=1 1=1 2=1280
BinaryOp         Mul_188                  2 1 658_splitncnn_0 683 686 0=2
Interp           Resize_190               1 1 686 691 0=2 1=2.000000e+00 2=2.000000e+00 3=0 4=0 6=0
Convolution      Conv_191                 1 1 691 692 0=96 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=3072000
Split            splitncnn_13             1 2 692 692_splitncnn_0 692_splitncnn_1
Crop             Slice_196                1 1 692_splitncnn_1 697 -23309=1,0 -23310=1,48 -23311=1,0
BatchNorm        BatchNormalization_197   1 1 697 698 0=48
Crop             Slice_202                1 1 692_splitncnn_0 703 -23309=1,48 -23310=1,2147483647 -23311=1,0
InstanceNorm     InstanceNormalization_205 1 1 703 706 0=48 1=1.000000e-05 2=0
Concat           Concat_206               2 1 698 706 707 0=0
ReLU             Relu_207                 1 1 707 708
Interp           Resize_209               1 1 708 713 0=2 1=2.000000e+00 2=2.000000e+00 3=0 4=0 6=0
Convolution      Conv_210                 1 1 713 714 0=32 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=76800
Split            splitncnn_14             1 2 714 714_splitncnn_0 714_splitncnn_1
Crop             Slice_215                1 1 714_splitncnn_1 719 -23309=1,0 -23310=1,16 -23311=1,0
BatchNorm        BatchNormalization_216   1 1 719 720 0=16
Crop             Slice_221                1 1 714_splitncnn_0 725 -23309=1,16 -23310=1,2147483647 -23311=1,0
InstanceNorm     InstanceNormalization_224 1 1 725 728 0=16 1=1.000000e-05 2=0
Concat           Concat_225               2 1 720 728 729 0=0
ReLU             Relu_226                 1 1 729 730
Split            splitncnn_15             1 2 730 730_splitncnn_0 730_splitncnn_1
Interp           Resize_228               1 1 input_splitncnn_2 735 0=2 1=5.000000e-01 2=5.000000e-01 3=0 4=0 6=0
Interp           Resize_230               1 1 input_splitncnn_1 740 0=2 1=2.500000e-01 2=2.500000e-01 3=0 4=0 6=0
Convolution      Conv_231                 1 1 1018_splitncnn_0 741 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Split            splitncnn_16             1 2 741 741_splitncnn_0 741_splitncnn_1
Crop             Slice_236                1 1 741_splitncnn_1 746 -23309=1,0 -23310=1,16 -23311=1,0
BatchNorm        BatchNormalization_237   1 1 746 747 0=16
Crop             Slice_242                1 1 741_splitncnn_0 752 -23309=1,16 -23310=1,2147483647 -23311=1,0
InstanceNorm     InstanceNormalization_245 1 1 752 755 0=16 1=1.000000e-05 2=0
Concat           Concat_246               2 1 747 755 756 0=0
ReLU             Relu_247                 1 1 756 757
Split            splitncnn_17             1 2 757 757_splitncnn_0 757_splitncnn_1
Concat           Concat_248               2 1 735 757_splitncnn_1 758 0=0
Convolution      Conv_249                 1 1 758 759 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=10080
Split            splitncnn_18             1 2 759 759_splitncnn_0 759_splitncnn_1
Crop             Slice_254                1 1 759_splitncnn_1 764 -23309=1,0 -23310=1,16 -23311=1,0
BatchNorm        BatchNormalization_255   1 1 764 765 0=16
Crop             Slice_260                1 1 759_splitncnn_0 770 -23309=1,16 -23310=1,2147483647 -23311=1,0
InstanceNorm     InstanceNormalization_263 1 1 770 773 0=16 1=1.000000e-05 2=0
Concat           Concat_264               2 1 765 773 774 0=0
ReLU             Relu_265                 1 1 774 775
Convolution      Conv_266                 1 1 476_splitncnn_0 776 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=768
Split            splitncnn_19             1 2 776 776_splitncnn_0 776_splitncnn_1
Crop             Slice_271                1 1 776_splitncnn_1 781 -23309=1,0 -23310=1,16 -23311=1,0
BatchNorm        BatchNormalization_272   1 1 781 782 0=16
Crop             Slice_277                1 1 776_splitncnn_0 787 -23309=1,16 -23310=1,2147483647 -23311=1,0
InstanceNorm     InstanceNormalization_280 1 1 787 790 0=16 1=1.000000e-05 2=0
Concat           Concat_281               2 1 782 790 791 0=0
ReLU             Relu_282                 1 1 791 792
Concat           Concat_283               2 1 775 792 793 0=0
Convolution      Conv_284                 1 1 793 794 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
Split            splitncnn_20             1 2 794 794_splitncnn_0 794_splitncnn_1
Crop             Slice_289                1 1 794_splitncnn_1 799 -23309=1,0 -23310=1,32 -23311=1,0
BatchNorm        BatchNormalization_290   1 1 799 800 0=32
Crop             Slice_295                1 1 794_splitncnn_0 805 -23309=1,32 -23310=1,2147483647 -23311=1,0
InstanceNorm     InstanceNormalization_298 1 1 805 808 0=32 1=1.000000e-05 2=0
Concat           Concat_299               2 1 800 808 809 0=0
ReLU             Relu_300                 1 1 809 810
Interp           Resize_302               1 1 730_splitncnn_1 815 0=2 1=2.000000e+00 2=2.000000e+00 3=0 4=0 6=0
Concat           Concat_303               3 1 810 815 740 816 0=0
Convolution      Conv_304                 1 1 816 817 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=57024
Split            splitncnn_21             1 2 817 817_splitncnn_0 817_splitncnn_1
Crop             Slice_309                1 1 817_splitncnn_1 822 -23309=1,0 -23310=1,32 -23311=1,0
BatchNorm        BatchNormalization_310   1 1 822 823 0=32
Crop             Slice_315                1 1 817_splitncnn_0 828 -23309=1,32 -23310=1,2147483647 -23311=1,0
InstanceNorm     InstanceNormalization_318 1 1 828 831 0=32 1=1.000000e-05 2=0
Concat           Concat_319               2 1 823 831 832 0=0
ReLU             Relu_320                 1 1 832 833
Convolution      Conv_321                 1 1 833 834 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
Split            splitncnn_22             1 2 834 834_splitncnn_0 834_splitncnn_1
Crop             Slice_326                1 1 834_splitncnn_1 839 -23309=1,0 -23310=1,32 -23311=1,0
BatchNorm        BatchNormalization_327   1 1 839 840 0=32
Crop             Slice_332                1 1 834_splitncnn_0 845 -23309=1,32 -23310=1,2147483647 -23311=1,0
InstanceNorm     InstanceNormalization_335 1 1 845 848 0=32 1=1.000000e-05 2=0
Concat           Concat_336               2 1 840 848 849 0=0
ReLU             Relu_337                 1 1 849 850
Convolution      Conv_338                 1 1 850 851 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=18432
Split            splitncnn_23             1 2 851 851_splitncnn_0 851_splitncnn_1
Crop             Slice_343                1 1 851_splitncnn_1 856 -23309=1,0 -23310=1,16 -23311=1,0
BatchNorm        BatchNormalization_344   1 1 856 857 0=16
Crop             Slice_349                1 1 851_splitncnn_0 862 -23309=1,16 -23310=1,2147483647 -23311=1,0
InstanceNorm     InstanceNormalization_352 1 1 862 865 0=16 1=1.000000e-05 2=0
Concat           Concat_353               2 1 857 865 866 0=0
ReLU             Relu_354                 1 1 866 867
Interp           Resize_356               1 1 867 872 0=2 1=2.000000e+00 2=2.000000e+00 3=0 4=0 6=0
Concat           Concat_357               2 1 872 757_splitncnn_0 873 0=0
Convolution      Conv_358                 1 1 873 874 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
Split            splitncnn_24             1 2 874 874_splitncnn_0 874_splitncnn_1
Crop             Slice_363                1 1 874_splitncnn_1 879 -23309=1,0 -23310=1,32 -23311=1,0
BatchNorm        BatchNormalization_364   1 1 879 880 0=32
Crop             Slice_369                1 1 874_splitncnn_0 885 -23309=1,32 -23310=1,2147483647 -23311=1,0
InstanceNorm     InstanceNormalization_372 1 1 885 888 0=32 1=1.000000e-05 2=0
Concat           Concat_373               2 1 880 888 889 0=0
ReLU             Relu_374                 1 1 889 890
Convolution      Conv_375                 1 1 890 891 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=18432
Split            splitncnn_25             1 2 891 891_splitncnn_0 891_splitncnn_1
Crop             Slice_380                1 1 891_splitncnn_1 896 -23309=1,0 -23310=1,16 -23311=1,0
BatchNorm        BatchNormalization_381   1 1 896 897 0=16
Crop             Slice_386                1 1 891_splitncnn_0 902 -23309=1,16 -23310=1,2147483647 -23311=1,0
InstanceNorm     InstanceNormalization_389 1 1 902 905 0=16 1=1.000000e-05 2=0
Concat           Concat_390               2 1 897 905 906 0=0
ReLU             Relu_391                 1 1 906 907
Convolution      Conv_392                 1 1 907 908 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=9216
Split            splitncnn_26             1 2 908 908_splitncnn_0 908_splitncnn_1
Crop             Slice_397                1 1 908_splitncnn_1 913 -23309=1,0 -23310=1,16 -23311=1,0
BatchNorm        BatchNormalization_398   1 1 913 914 0=16
Crop             Slice_403                1 1 908_splitncnn_0 919 -23309=1,16 -23310=1,2147483647 -23311=1,0
InstanceNorm     InstanceNormalization_406 1 1 919 922 0=16 1=1.000000e-05 2=0
Concat           Concat_407               2 1 914 922 923 0=0
ReLU             Relu_408                 1 1 923 924
Convolution      Conv_409                 1 1 924 925 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=9216
Split            splitncnn_27             1 2 925 925_splitncnn_0 925_splitncnn_1
Crop             Slice_414                1 1 925_splitncnn_1 930 -23309=1,0 -23310=1,16 -23311=1,0
BatchNorm        BatchNormalization_415   1 1 930 931 0=16
Crop             Slice_420                1 1 925_splitncnn_0 936 -23309=1,16 -23310=1,2147483647 -23311=1,0
InstanceNorm     InstanceNormalization_423 1 1 936 939 0=16 1=1.000000e-05 2=0
Concat           Concat_424               2 1 931 939 940 0=0
ReLU             Relu_425                 1 1 940 941
Interp           Resize_427               1 1 730_splitncnn_0 946 0=2 1=2.000000e+00 2=2.000000e+00 3=0 4=0 6=0
Convolution      Conv_428                 1 1 946 947 0=32 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=25600
Split            splitncnn_28             1 2 947 947_splitncnn_0 947_splitncnn_1
Crop             Slice_433                1 1 947_splitncnn_1 952 -23309=1,0 -23310=1,16 -23311=1,0
BatchNorm        BatchNormalization_434   1 1 952 953 0=16
Crop             Slice_439                1 1 947_splitncnn_0 958 -23309=1,16 -23310=1,2147483647 -23311=1,0
InstanceNorm     InstanceNormalization_442 1 1 958 961 0=16 1=1.000000e-05 2=0
Concat           Concat_443               2 1 953 961 962 0=0
ReLU             Relu_444                 1 1 962 963
Interp           Resize_446               1 1 963 968 0=2 1=2.000000e+00 2=2.000000e+00 3=0 4=0 6=0
Concat           Concat_447               2 1 968 941 969 0=0
Convolution      Conv_448                 1 1 969 970 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=18432
Split            splitncnn_29             1 2 970 970_splitncnn_0 970_splitncnn_1
Crop             Slice_453                1 1 970_splitncnn_1 975 -23309=1,0 -23310=1,16 -23311=1,0
BatchNorm        BatchNormalization_454   1 1 975 976 0=16
Crop             Slice_459                1 1 970_splitncnn_0 981 -23309=1,16 -23310=1,2147483647 -23311=1,0
InstanceNorm     InstanceNormalization_462 1 1 981 984 0=16 1=1.000000e-05 2=0
Concat           Concat_463               2 1 976 984 985 0=0
ReLU             Relu_464                 1 1 985 986
Interp           Resize_466               1 1 986 991 0=2 1=2.000000e+00 2=2.000000e+00 3=0 4=0 6=0
Concat           Concat_467               2 1 991 input_splitncnn_0 992 0=0
Convolution      Conv_468                 1 1 992 993 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=5040
Split            splitncnn_30             1 2 993 993_splitncnn_0 993_splitncnn_1
Crop             Slice_473                1 1 993_splitncnn_1 998 -23309=1,0 -23310=1,8 -23311=1,0
BatchNorm        BatchNormalization_474   1 1 998 999 0=8
Crop             Slice_479                1 1 993_splitncnn_0 1004 -23309=1,8 -23310=1,2147483647 -23311=1,0
InstanceNorm     InstanceNormalization_482 1 1 1004 1007 0=8 1=1.000000e-05 2=0
Concat           Concat_483               2 1 999 1007 1008 0=0
ReLU             Relu_484                 1 1 1008 1009
Convolution      Conv_485                 1 1 1009 1010 0=1 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16
Sigmoid          Sigmoid_486              1 1 1010 output
